[
  {
    "anxiety": [
      {
        "reference": "Surah Al-Baqarah 2:286",
        "translation": "Allah does not burden any soul beyond what it can bear.",
        "arabic_text": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا",
        "reflection": "This verse offers deep reassurance that Allah's divine wisdom ensures we are never tested beyond our capacity. When anxiety overwhelms us, we can find solace knowing that Allah recognizes our limits and has tailored our challenges accordingly.",
        "verseNumber": 286,
        "surahNumber": 2,
        "ayahNumber": [
          286
        ],
        "full_verse": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:155",
        "translation": "We will certainly test you with some fear, hunger, loss of wealth, lives, and crops. But give good news to those who are patient.",
        "arabic_text": "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ",
        "reflection": "This verse acknowledges the reality of trials while promising reward. Allah informs us that difficulties are inevitable but purposeful - they are not random suffering but divine tests through which believers can demonstrate patience and earn Allah's pleasure.",
        "verseNumber": 155,
        "surahNumber": 2,
        "ayahNumber": [
          155
        ],
        "full_verse": "وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Ar-Ra'd 13:28",
        "translation": "Verily, in the remembrance of Allah do hearts find comfort.",
        "arabic_text": "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
        "reflection": "This verse reveals the remedy for anxiety - dhikr (remembrance of Allah). When hearts are troubled by worldly concerns, turning to Allah through prayer, Quran recitation, and meditation on His names provides a unique tranquility that nothing else can replicate.",
        "verseNumber": 3233,
        "surahNumber": 13,
        "ayahNumber": [
          28
        ],
        "full_verse": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ"
      },
      {
        "reference": "Surah At-Tawbah 9:51",
        "translation": "Say, 'Nothing will ever befall us except what Allah has destined for us. He is our Protector.'",
        "arabic_text": "قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا",
        "reflection": "This verse teaches tawakkul (reliance on Allah). Understanding that everything happens by Allah's decree helps us release anxiety about outcomes. Allah is not just a witness to our struggles but actively protects and supports the believers.",
        "verseNumber": 1262,
        "surahNumber": 9,
        "ayahNumber": [
          51
        ],
        "full_verse": "قُلْ لَنْ يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ"
      },
      {
        "reference": "Surah Ali 'Imran 3:139",
        "translation": "Do not lose heart or grieve, for you will have the upper hand, if you are believers.",
        "arabic_text": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
        "reflection": "Revealed after the Battle of Uhud, this verse provides psychological strength during apparent setbacks. It reminds believers that temporary defeats do not determine final outcomes when faith remains strong, transforming anxiety into determined hope.",
        "verseNumber": 450,
        "surahNumber": 3,
        "ayahNumber": [
          139
        ],
        "full_verse": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنْتُمُ الْأَعْلَوْنَ إِنْ كُنْتُمْ مُؤْمِنِينَ"
      },
      {
        "reference": "Surah Al-Fath 48:4",
        "translation": "It is He who sent down tranquility into the hearts of the believers.",
        "arabic_text": "هُوَ الَّذِي أَنزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ",
        "reflection": "This verse reminds us that tranquility is a divine gift that Allah places directly into believers' hearts. During times of anxiety, we can turn to Allah knowing He is the source of true peace.",
        "verseNumber": 4821,
        "surahNumber": 48,
        "ayahNumber": [
          4
        ],
        "full_verse": "هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ ۗ وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا"
      },
      {
        "reference": "Surah Al-Hadid 57:20",
        "translation": "Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children.",
        "arabic_text": "اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ",
        "reflection": "This verse puts worldly concerns into perspective. By understanding the temporary nature of worldly stress triggers, believers can reduce anxiety about matters that ultimately have limited significance.",
        "verseNumber": 5214,
        "surahNumber": 57,
        "ayahNumber": [
          20
        ],
        "full_verse": "اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ ۖ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَامًا ۖ وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِنَ اللَّهِ وَرِضْوَانٌ ۚ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ"
      },
      {
        "reference": "Surah Al-Baqarah 2:216",
        "translation": "Perhaps you dislike something which is good for you and like something which is bad for you. Allah knows and you do not know.",
        "arabic_text": "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ ۖ وَعَسَىٰ أَن تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَّكُمْ",
        "reflection": "This verse reminds us that our anxiety may be misplaced, as what we perceive as negative might actually benefit us in ways we cannot yet comprehend. It encourages trust in Allah's wisdom over our limited perspective.",
        "verseNumber": 223,
        "surahNumber": 2,
        "ayahNumber": [
          216
        ],
        "full_verse": "كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ"
      },
      {
        "reference": "Surah Al-Anfal 8:33",
        "translation": "But Allah would not punish them while you are amongst them.",
        "arabic_text": "وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ",
        "reflection": "This verse, addressed to Prophet Muhammad, illustrates Allah's mercy. It reassures believers that divine protection exists even amidst seemingly anxious circumstances.",
        "verseNumber": 1080,
        "surahNumber": 8,
        "ayahNumber": [
          33
        ],
        "full_verse": "وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ ۚ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ"
      },
      {
        "reference": "Surah Al-Hadid 57:4",
        "translation": "He is with you wherever you are.",
        "arabic_text": "وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ",
        "reflection": "This powerful reminder of Allah's omnipresence offers comfort during anxiety. No matter where we are or what circumstances we face, we are never truly alone.",
        "verseNumber": 5198,
        "surahNumber": 57,
        "ayahNumber": [
          4
        ],
        "full_verse": "هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ"
      },
      {
        "reference": "Surah Ar-Rum 30:60",
        "translation": "So be patient. Indeed, the promise of Allah is truth.",
        "arabic_text": "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ",
        "reflection": "This verse encourages patience during anxious times by affirming the certainty of Allah's promises. Knowing that divine relief is guaranteed can help believers endure present difficulties.",
        "verseNumber": 3630,
        "surahNumber": 30,
        "ayahNumber": [
          60
        ],
        "full_verse": "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ وَلَا يَسْتَخِفَّنَّكَ الَّذِينَ لَا يُوقِنُونَ"
      },
      {
        "reference": "Surah Az-Zumar 39:10",
        "translation": "Say: 'O My servants who believe! Be mindful of your Lord. Good is for those who do good in this world. And Allah's earth is spacious. Those who are patient will be given their reward without measure.'",
        "arabic_text": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ",
        "reflection": "This verse reminds anxious believers that options always exist, as Allah's earth is spacious. It encourages perseverance by promising unlimited rewards for those who remain patient through difficulties.",
        "verseNumber": 4169,
        "surahNumber": 39,
        "ayahNumber": [
          10
        ],
        "full_verse": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ"
      },
      {
        "reference": "Surah Ad-Duha 93:3",
        "translation": "Your Lord has not forsaken you, nor is He displeased.",
        "arabic_text": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ",
        "reflection": "Revealed during a period when divine revelation had paused, causing the Prophet anxiety, this verse reassures believers that periods of apparent divine silence do not indicate abandonment or displeasure.",
        "verseNumber": 6063,
        "surahNumber": 93,
        "ayahNumber": [
          3
        ],
        "full_verse": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ"
      },
      {
        "reference": "Surah Al-Furqan 25:31",
        "translation": "And sufficient is your Lord as a Guide and Helper.",
        "arabic_text": "وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا",
        "reflection": "This verse addresses anxiety by reminding believers that Allah's guidance and support are always sufficient. When human assistance seems inadequate, divine help remains complete and perfect.",
        "verseNumber": 2908,
        "surahNumber": 25,
        "ayahNumber": [
          31
        ],
        "full_verse": "وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِنَ الْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا"
      },
      {
        "reference": "Surah An-Nahl 16:97",
        "translation": "Whoever does righteousness, whether male or female, while being a believer - We will surely cause them to live a good life.",
        "arabic_text": "مَنْ عَمِلَ صَالِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً",
        "reflection": "This verse addresses the anxiety about purpose and quality of life. It promises a 'good life' to righteous believers regardless of gender, offering assurance that faith and good deeds lead to genuine fulfillment.",
        "verseNumber": 2062,
        "surahNumber": 16,
        "ayahNumber": [
          97
        ],
        "full_verse": "مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ"
      },
      {
        "reference": "Surah Ad-Duha 93:4",
        "translation": "And the Hereafter is better for you than the first [life].",
        "arabic_text": "وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ",
        "reflection": "This verse relieves anxiety by reminding believers that our ultimate destination surpasses any worldly experience. Temporary difficulties lose their power when viewed against the backdrop of eternal joy.",
        "verseNumber": 6064,
        "surahNumber": 93,
        "ayahNumber": [
          4
        ],
        "full_verse": "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ"
      }
    ],
    "gratitude": [
      {
        "reference": "Surah Ibrahim 14:7",
        "translation": "If you are grateful, I will certainly give you more.",
        "arabic_text": "لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ",
        "reflection": "This verse establishes a divine principle - gratitude leads to increase. When we acknowledge Allah's blessings, He promises not only to preserve them but to multiply them. Ingratitude, conversely, may lead to their removal.",
        "verseNumber": 1806,
        "surahNumber": 14,
        "ayahNumber": [
          7
        ],
        "full_verse": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِنْ كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ"
      },
      {
        "reference": "Surah Ar-Rahman 55:13",
        "translation": "So which of your Lord's favors will you both deny?",
        "arabic_text": "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
        "reflection": "Throughout Surah Ar-Rahman, this refrain appears after mentions of Allah's countless blessings. It serves as a powerful reminder to recognize divine gifts that we often take for granted, from the cosmos to the minutest details of creation.",
        "verseNumber": 5108,
        "surahNumber": 55,
        "ayahNumber": [
          13
        ],
        "full_verse": "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ"
      },
      {
        "reference": "Surah Al-Baqarah 2:152",
        "translation": "Therefore remember Me, I will remember you. And be grateful to Me and never be ungrateful.",
        "arabic_text": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
        "reflection": "This verse links remembrance and gratitude as twin obligations. Allah's 'remembering us' represents His attention, care, and response to our needs, making gratitude not just appropriate but essential as recognition of this divine engagement.",
        "verseNumber": 159,
        "surahNumber": 2,
        "ayahNumber": [
          152
        ],
        "full_verse": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ"
      },
      {
        "reference": "Surah Ibrahim 14:34",
        "translation": "And He has given you all that you asked of Him. If you tried to count Allah's blessings, you would never be able to number them.",
        "arabic_text": "وَآتَاكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ ۚ وَإِن تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا",
        "reflection": "This verse highlights the impossibility of enumerating Allah's favors, which include both what we recognize and what remains hidden from us. It inspires humility and recognition of our complete dependence on the Creator's generosity.",
        "verseNumber": 1833,
        "surahNumber": 14,
        "ayahNumber": [
          34
        ],
        "full_verse": "وَآتَاكُمْ مِنْ كُلِّ مَا سَأَلْتُمُوهُ ۚ وَإِنْ تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ الْإِنْسَانَ لَظَلُومٌ كَفَّارٌ"
      },
      {
        "reference": "Surah An-Nahl 16:78",
        "translation": "And Allah has brought you forth from the wombs of your mothers not knowing a thing, and He made for you hearing and vision and hearts [intellect] so perhaps you would be grateful.",
        "arabic_text": "وَاللَّهُ أَخْرَجَكُم مِّن بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۙ لَعَلَّكُمْ تَشْكُرُونَ",
        "reflection": "This verse identifies our sensory and cognitive capacities as gifts deserving gratitude. Our very ability to perceive and understand the world is a divine blessing that should inspire continuous thankfulness rather than being taken for granted.",
        "verseNumber": 2043,
        "surahNumber": 16,
        "ayahNumber": [
          78
        ],
        "full_verse": "وَاللَّهُ أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۙ لَعَلَّكُمْ تَشْكُرُونَ"
      },
      {
        "reference": "Surah Luqman 31:14",
        "translation": "And We have enjoined upon man [care] for his parents. His mother carried him, [increasing her] in weakness upon weakness, and his weaning is in two years. Be grateful to Me and to your parents; to Me is the [final] destination.",
        "arabic_text": "وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَىٰ وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ",
        "reflection": "This verse connects gratitude to Allah with gratitude to parents, particularly highlighting the mother's sacrifice. It teaches that recognizing human instruments of divine blessing is an essential part of thanking the Ultimate Benefactor.",
        "verseNumber": 3590,
        "surahNumber": 31,
        "ayahNumber": [
          14
        ],
        "full_verse": "وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَىٰ وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ"
      },
      {
        "reference": "Surah Al-Jumu'ah 62:11",
        "translation": "But when they saw a transaction or a diversion, they rushed to it and left you standing. Say, 'What is with Allah is better than diversion and than a transaction, and Allah is the best of providers.'",
        "arabic_text": "قُلْ مَا عِندَ اللَّهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ",
        "reflection": "This verse reminds believers to cultivate gratitude for spiritual provisions over material gains. It encourages appreciation for divine guidance as the ultimate blessing, superior to worldly distractions and commercial success.",
        "verseNumber": 5410,
        "surahNumber": 62,
        "ayahNumber": [
          11
        ],
        "full_verse": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ"
      },
      {
        "reference": "Surah Al-'Ankabut 29:17",
        "translation": "You only worship, besides Allah, idols, and you produce a falsehood. Indeed, those you worship besides Allah do not possess for you [the power of] provision. So seek from Allah provision and worship Him and be grateful to Him.",
        "arabic_text": "فَابْتَغُوا عِندَ اللَّهِ الرِّزْقَ وَاعْبُدُوهُ وَاشْكُرُوا لَهُ",
        "reflection": "This verse establishes gratitude as a natural response to recognizing Allah as the true source of all provision. It clarifies that thankfulness follows logically from understanding who actually provides our sustenance.",
        "verseNumber": 3396,
        "surahNumber": 29,
        "ayahNumber": [
          17
        ],
        "full_verse": "إِنَّمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ أَوْثَانًا وَتَخْلُقُونَ إِفْكًا ۚ إِنَّ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ لَا يَمْلِكُونَ لَكُمْ رِزْقًا فَابْتَغُوا عِنْدَ اللَّهِ الرِّزْقَ وَاعْبُدُوهُ وَاشْكُرُوا لَهُ ۖ إِلَيْهِ تُرْجَعُونَ"
      },
      {
        "reference": "Surah Ad-Duha 93:7",
        "translation": "And He found you lost and guided [you].",
        "arabic_text": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ",
        "reflection": "Originally addressed to Prophet Muhammad, this verse reminds all believers to be grateful for divine guidance. It acknowledges that spiritual direction is not self-generated but a blessing for which gratitude is due.",
        "verseNumber": 6067,
        "surahNumber": 93,
        "ayahNumber": [
          7
        ],
        "full_verse": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ"
      }
    ],
    "sadness": [
      {
        "reference": "Surah Al-Baqarah 2:153",
        "translation": "O believers! Seek comfort in patience and prayer. Allah is truly with those who are patient.",
        "arabic_text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "reflection": "This verse prescribes two spiritual remedies for sadness - sabr (patience) and salah (prayer). When grief weighs heavy, turning to Allah through disciplined patience and focused prayer connects us to the Ultimate Source of comfort.",
        "verseNumber": 160,
        "surahNumber": 2,
        "ayahNumber": [
          153
        ],
        "full_verse": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Yusuf 12:86",
        "translation": "I only complain of my suffering and grief to Allah.",
        "arabic_text": "إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ",
        "reflection": "Spoken by Prophet Yaqub after years of separation from his beloved son Yusuf, this verse teaches the proper etiquette of grief. Rather than complaining to people, directing our sorrows to Allah acknowledges His power to provide relief and demonstrates trust in His wisdom.",
        "verseNumber": 1682,
        "surahNumber": 12,
        "ayahNumber": [
          86
        ],
        "full_verse": "قَالَ إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:216",
        "translation": "Perhaps you dislike something which is good for you and like something which is bad for you. Allah knows and you do not know.",
        "arabic_text": "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ ۖ وَعَسَىٰ أَن تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَّكُمْ",
        "reflection": "This profound verse reminds us that our limited perspective may cause us to grieve over circumstances that are actually beneficial. What appears as misfortune might be Allah's protection or a gateway to greater good that only becomes apparent later.",
        "verseNumber": 223,
        "surahNumber": 2,
        "ayahNumber": [
          216
        ],
        "full_verse": "كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ"
      },
      {
        "reference": "Surah An-Nisa 4:40",
        "translation": "Allah does not wrong anyone—even by an atom's weight.",
        "arabic_text": "إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ",
        "reflection": "This verse assures us of divine justice during times of sadness. Knowing that Allah never commits even the slightest injustice helps believers maintain faith in His wisdom and mercy even when events seem unfair from our limited perspective.",
        "verseNumber": 533,
        "surahNumber": 4,
        "ayahNumber": [
          40
        ],
        "full_verse": "إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ ۖ وَإِنْ تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِنْ لَدُنْهُ أَجْرًا عَظِيمًا"
      },
      {
        "reference": "Surah At-Taghabun 64:11",
        "translation": "No disaster strikes except by Allah's permission. And whoever believes in Allah, He guides their heart.",
        "arabic_text": "مَا أَصَابَ مِن مُّصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ وَمَن يُؤْمِن بِاللَّهِ يَهْدِ قَلْبَهُ",
        "reflection": "This verse explains how faith transforms our response to calamities. Belief in Allah's complete control enables Him to guide our hearts toward acceptance and wisdom rather than bitterness and despair when facing painful circumstances.",
        "verseNumber": 5433,
        "surahNumber": 64,
        "ayahNumber": [
          11
        ],
        "full_verse": "مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ"
      },
      {
        "reference": "Surah Ash-Shura 42:37",
        "translation": "And those who avoid the major sins and immoralities, and when they are angry, they forgive.",
        "arabic_text": "وَالَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ وَإِذَا مَا غَضِبُوا هُمْ يَغْفِرُونَ",
        "reflection": "This verse offers a path through the sadness caused by others' wrongs. By choosing forgiveness over resentment, believers can release the burden of anger and find emotional healing.",
        "verseNumber": 4582,
        "surahNumber": 42,
        "ayahNumber": [
          37
        ],
        "full_verse": "وَالَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ وَإِذَا مَا غَضِبُوا هُمْ يَغْفِرُونَ"
      },
      {
        "reference": "Surah An-Nisa 4:128",
        "translation": "And reconciliation is best.",
        "arabic_text": "وَالصُّلْحُ خَيْرٌ",
        "reflection": "This short but powerful statement guides those experiencing relational sadness. It reminds believers that healing broken connections often brings greater relief than maintaining conflict or separation.",
        "verseNumber": 621,
        "surahNumber": 4,
        "ayahNumber": [
          128
        ],
        "full_verse": "وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا فَلَا جُنَاحَ عَلَيْهِمَا أَنْ يُصْلِحَا بَيْنَهُمَا صُلْحًا ۚ وَالصُّلْحُ خَيْرٌ ۗ وَأُحْضِرَتِ الْأَنْفُسُ الشُّحَّ ۚ وَإِنْ تُحْسِنُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا"
      },
      {
        "reference": "Surah An-Nahl 16:127",
        "translation": "And be patient, and your patience is not but through Allah. And do not grieve over them and do not be in distress over what they conspire.",
        "arabic_text": "وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِي ضَيْقٍ مِّمَّا يَمْكُرُونَ",
        "reflection": "This verse addresses sadness caused by others' opposition or rejection. It reminds believers that true patience comes from Allah and encourages emotional detachment from others' negative actions.",
        "verseNumber": 2092,
        "surahNumber": 16,
        "ayahNumber": [
          127
        ],
        "full_verse": "وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:286",
        "translation": "Allah does not burden any soul beyond what it can bear.",
        "arabic_text": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا",
        "reflection": "This verse comforts those in sadness by affirming divine consideration of our capacity. No matter how overwhelming grief feels, Allah has measured it to be within our ability to endure with His help.",
        "verseNumber": 286,
        "surahNumber": 2,
        "ayahNumber": [
          286
        ],
        "full_verse": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ"
      },
      {
        "reference": "Surah Ad-Duha 93:4",
        "translation": "And the Hereafter is better for you than the first [life].",
        "arabic_text": "وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ",
        "reflection": "This verse provides perspective during sadness by directing attention to eternal joy. It reminds believers that worldly sorrows are temporary compared to the lasting happiness of the hereafter.",
        "verseNumber": 6064,
        "surahNumber": 93,
        "ayahNumber": [
          4
        ],
        "full_verse": "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ"
      },
      {
        "reference": "Surah Al-Anfal 8:46",
        "translation": "And be patient. Indeed, Allah is with the patient.",
        "arabic_text": "وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "reflection": "This verse offers special divine companionship to those who bear sadness with patience. The promise of Allah's presence provides comfort that exceeds any human consolation.",
        "verseNumber": 1093,
        "surahNumber": 8,
        "ayahNumber": [
          46
        ],
        "full_verse": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-Hadid 57:4",
        "translation": "He is with you wherever you are.",
        "arabic_text": "وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ",
        "reflection": "This verse addresses the isolation often felt during sadness. It reminds believers that even in their darkest moments, divine presence remains constant and immediate.",
        "verseNumber": 5198,
        "surahNumber": 57,
        "ayahNumber": [
          4
        ],
        "full_verse": "هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ"
      },
      {
        "reference": "Surah Az-Zumar 39:10",
        "translation": "Indeed, the patient will be given their reward without account.",
        "arabic_text": "إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ",
        "reflection": "This verse promises extraordinary compensation for those who bear sadness with patience. Unlike limited worldly rewards, the divine recompense for enduring grief will be immeasurable.",
        "verseNumber": 4169,
        "surahNumber": 39,
        "ayahNumber": [
          10
        ],
        "full_verse": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ"
      },
      {
        "reference": "Surah An-Nahl 16:126",
        "translation": "And if you punish [an enemy], punish with an equivalent of that with which you were harmed. But if you are patient - it is better for those who are patient.",
        "arabic_text": "وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُم بِهِ ۖ وَلَئِن صَبَرْتُمْ لَهُوَ خَيْرٌ لِّلصَّابِرِينَ",
        "reflection": "This verse guides those saddened by injustice. While permitting proportional response, it highlights patience as the superior choice, offering believers a path to emotional healing beyond mere retribution.",
        "verseNumber": 2091,
        "surahNumber": 16,
        "ayahNumber": [
          126
        ],
        "full_verse": "وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُمْ بِهِ ۖ وَلَئِنْ صَبَرْتُمْ لَهُوَ خَيْرٌ لِلصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-'Ankabut 29:69",
        "translation": "And those who strive for Us - We will surely guide them to Our ways.",
        "arabic_text": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا",
        "reflection": "This verse comforts those saddened by spiritual struggles. It promises divine guidance to those who persevere through difficulties, showing that effort toward Allah during times of sadness never goes unnoticed.",
        "verseNumber": 3448,
        "surahNumber": 29,
        "ayahNumber": [
          69
        ],
        "full_verse": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ"
      },
      {
        "reference": "Surah Ad-Duha 93:3",
        "translation": "Your Lord has not forsaken you, nor is He displeased.",
        "arabic_text": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ",
        "reflection": "Originally sent to comfort Prophet Muhammad during a period without revelation, this verse addresses the sadness of feeling disconnected from Allah. It reassures believers that divine silence doesn't indicate abandonment.",
        "verseNumber": 6063,
        "surahNumber": 93,
        "ayahNumber": [
          3
        ],
        "full_verse": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ"
      },
      {
        "reference": "Surah Al-Furqan 25:31",
        "translation": "And sufficient is your Lord as a Guide and Helper.",
        "arabic_text": "وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا",
        "reflection": "This verse addresses the sadness of feeling lost or unassisted. It reminds believers that Allah's guidance and support are always complete and sufficient, requiring no additional help.",
        "verseNumber": 2908,
        "surahNumber": 25,
        "ayahNumber": [
          31
        ],
        "full_verse": "وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِنَ الْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا"
      }
    ],
    "hope": [
      {
        "reference": "Surah Ash-Sharh 94:5-6",
        "translation": "So, surely with hardship comes ease. Surely with hardship comes ease.",
        "arabic_text": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا. إِنَّ مَعَ الْعُسْرِ يُسْرًا",
        "reflection": "The repetition of this promise emphasizes its certainty. Allah does not merely state that ease follows hardship but that ease accompanies it. This instills hope during difficulties by assuring believers that relief is already being prepared alongside their trials.",
        "verseNumber": 6075,
        "surahNumber": 94,
        "ayahNumber": [
          5,
          6
        ],
        "full_verse": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا إِنَّ مَعَ الْعُسْرِ يُسْرًا"
      },
      {
        "reference": "Surah Ash-Sharh 94:1-2",
        "translation": "Have We not uplifted your heart for you ˹O Prophet˺, and relieved you of the burden.",
        "arabic_text": "أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ. وَوَضَعْنَا عَنكَ وِزْرَكَ",
        "reflection": "These verses remind believers that Allah has already demonstrated His pattern of providing relief. Just as He eased the Prophet's burdens and expanded his capacity for challenges, He can similarly transform our constraints into spaciousness.",
        "verseNumber": 6071,
        "surahNumber": 94,
        "ayahNumber": [
          1,
          2
        ],
        "full_verse": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ وَوَضَعْنَا عَنْكَ وِزْرَكَ"
      },
      {
        "reference": "Surah Ad-Duha 93:5",
        "translation": "And your Lord is going to give you, and you will be satisfied.",
        "arabic_text": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
        "reflection": "Originally addressed to Prophet Muhammad during a time of distress, this verse extends hope to all believers. Allah promises not just provision but satisfaction - complete contentment with what He bestows, indicating both generosity and understanding of our deepest needs.",
        "verseNumber": 6065,
        "surahNumber": 93,
        "ayahNumber": [
          5
        ],
        "full_verse": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ"
      },
      {
        "reference": "Surah Az-Zumar 39:53",
        "translation": "Say, 'O My servants who have transgressed against themselves, do not despair of Allah's mercy. Allah forgives all sins.'",
        "arabic_text": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا",
        "reflection": "This verse offers hope even to those burdened by sins. Allah's mercy transcends our misconceptions of worthiness, and no sin is too great for His forgiveness when accompanied by sincere repentance. It invites even the most distant hearts back to divine compassion.",
        "verseNumber": 4212,
        "surahNumber": 39,
        "ayahNumber": [
          53
        ],
        "full_verse": "۞ قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ"
      },
      {
        "reference": "Surah At-Talaq 65:2-3",
        "translation": "And whoever fears Allah, He will make for him a way out and will provide for him from where he does not expect.",
        "arabic_text": "وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا. وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ",
        "reflection": "This verse promises divine solutions to seemingly impossible situations. It gives hope by assuring believers that conscientiousness toward Allah's commands opens unexpected paths of provision and escape from difficulties that human calculation cannot foresee.",
        "verseNumber": 5476,
        "surahNumber": 65,
        "ayahNumber": [
          2,
          3
        ],
        "full_verse": "فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُوا ذَوَيْ عَدْلٍ مِنْكُمْ وَأَقِيمُوا الشَّهَادَةَ لِلَّهِ ۚ ذَٰلِكُمْ يُوعَظُ بِهِ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا"
      },
      {
        "reference": "Surah Ad-Duha 93:4",
        "translation": "And the Hereafter is better for you than the first [life].",
        "arabic_text": "وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ",
        "reflection": "This verse instills hope by promising that the best is yet to come. It encourages believers to maintain perspective during difficult times, knowing that eternal rewards far outweigh temporary hardships.",
        "verseNumber": 6064,
        "surahNumber": 93,
        "ayahNumber": [
          4
        ],
        "full_verse": "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ"
      },
      {
        "reference": "Surah Al-Anfal 8:46",
        "translation": "And be patient. Indeed, Allah is with the patient.",
        "arabic_text": "وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "reflection": "This verse offers hope through the promise of divine companionship. The assurance that Allah specifically accompanies those who persevere gives believers strength to endure challenging circumstances with optimism.",
        "verseNumber": 1093,
        "surahNumber": 8,
        "ayahNumber": [
          46
        ],
        "full_verse": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Ad-Duha 93:7",
        "translation": "And He found you lost and guided [you].",
        "arabic_text": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ",
        "reflection": "This verse kindles hope by reminding believers of Allah's guidance in their past. Recognizing previous instances of divine direction helps maintain confidence that Allah will continue providing guidance through present and future challenges.",
        "verseNumber": 6067,
        "surahNumber": 93,
        "ayahNumber": [
          7
        ],
        "full_verse": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ"
      },
      {
        "reference": "Surah Ar-Rum 30:60",
        "translation": "So be patient. Indeed, the promise of Allah is truth.",
        "arabic_text": "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ",
        "reflection": "This verse strengthens hope by affirming the absolute reliability of divine promises. It encourages believers to maintain confidence that Allah's assurances of relief, reward, and mercy will certainly be fulfilled.",
        "verseNumber": 3630,
        "surahNumber": 30,
        "ayahNumber": [
          60
        ],
        "full_verse": "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ وَلَا يَسْتَخِفَّنَّكَ الَّذِينَ لَا يُوقِنُونَ"
      },
      {
        "reference": "Surah Al-Jumu'ah 62:11",
        "translation": "Say, 'What is with Allah is better than diversion and than a transaction, and Allah is the best of providers.'",
        "arabic_text": "قُلْ مَا عِندَ اللَّهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ",
        "reflection": "This verse inspires hope by redirecting focus from worldly gains to divine provision. It reminds believers that what Allah offers - both spiritually and materially - surpasses anything obtainable through human effort alone.",
        "verseNumber": 5410,
        "surahNumber": 62,
        "ayahNumber": [
          11
        ],
        "full_verse": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ"
      },
      {
        "reference": "Surah Az-Zumar 39:10",
        "translation": "Indeed, the patient will be given their reward without account.",
        "arabic_text": "إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ",
        "reflection": "This verse nourishes hope through the promise of unlimited rewards. The assurance that patient believers will receive compensation beyond measure encourages persistence through difficulties with positive expectation.",
        "verseNumber": 4169,
        "surahNumber": 39,
        "ayahNumber": [
          10
        ],
        "full_verse": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ"
      },
      {
        "reference": "Surah An-Nahl 16:126",
        "translation": "But if you are patient - it is better for those who are patient.",
        "arabic_text": "وَلَئِن صَبَرْتُمْ لَهُوَ خَيْرٌ لِّلصَّابِرِينَ",
        "reflection": "This verse cultivates hope by assuring believers that patience leads to superior outcomes. It encourages trusting Allah's judgment over immediate gratification, with confidence that restraint ultimately yields better results.",
        "verseNumber": 2091,
        "surahNumber": 16,
        "ayahNumber": [
          126
        ],
        "full_verse": "وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُمْ بِهِ ۖ وَلَئِنْ صَبَرْتُمْ لَهُوَ خَيْرٌ لِلصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-Furqan 25:31",
        "translation": "And sufficient is your Lord as a Guide and Helper.",
        "arabic_text": "وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا",
        "reflection": "This verse nurtures hope through the assurance of divine sufficiency. Knowing that Allah's guidance and assistance are completely adequate inspires confidence even when human support seems inadequate or unavailable.",
        "verseNumber": 2908,
        "surahNumber": 25,
        "ayahNumber": [
          31
        ],
        "full_verse": "وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِنَ الْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا"
      },
      {
        "reference": "Surah At-Tawbah 9:40",
        "translation": "Do not grieve; indeed Allah is with us.",
        "arabic_text": "لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
        "reflection": "Spoken by Prophet Muhammad to Abu Bakr while hiding from pursuers, this verse offers hope through the promise of divine company during adversity. It reminds believers that Allah's presence transforms seemingly hopeless situations.",
        "verseNumber": 1251,
        "surahNumber": 9,
        "ayahNumber": [
          40
        ],
        "full_verse": "إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ"
      }
    ],
    "joy": [
      {
        "reference": "Surah Ali 'Imran 3:170",
        "translation": "Rejoicing in Allah's bounty which He has bestowed upon them.",
        "arabic_text": "فَرِحِينَ بِمَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ",
        "reflection": "This verse describes the state of martyrs in paradise, experiencing pure joy from Allah's blessings. It illustrates that true, lasting joy comes not from material possessions but from divine favor and closeness to Allah.",
        "verseNumber": 481,
        "surahNumber": 3,
        "ayahNumber": [
          170
        ],
        "full_verse": "فَرِحِينَ بِمَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ وَيَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِمْ مِنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ"
      },
      {
        "reference": "Surah Yunus 10:58",
        "translation": "Say, 'In Allah's grace and mercy let them rejoice. That is far better than whatever ˹wealth˺ they amass.'",
        "arabic_text": "قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِّمَّا يَجْمَعُونَ",
        "reflection": "This verse reorients our sources of happiness. While people often seek joy in accumulating wealth, Allah directs believers to find it in His grace and mercy - intangible but infinitely more valuable and sustainable gifts.",
        "verseNumber": 1415,
        "surahNumber": 10,
        "ayahNumber": [
          58
        ],
        "full_verse": "قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ"
      },
      {
        "reference": "Surah As-Saffat 37:44",
        "translation": "They will be in Gardens of Pleasure, on thrones facing each other.",
        "arabic_text": "عَلَىٰ سُرُرٍ مُّتَقَابِلِينَ",
        "reflection": "This description of paradise shows that joy in the hereafter includes both physical comfort and social harmony. Believers will enjoy perfect companionship without the jealousy, competition, or isolation that often tarnish earthly happiness.",
        "verseNumber": 3945,
        "surahNumber": 37,
        "ayahNumber": [
          44
        ],
        "full_verse": "عَلَىٰ سُرُرٍ مُتَقَابِلِينَ"
      },
      {
        "reference": "Surah Adh-Dhariyat 51:15-16",
        "translation": "Indeed, the righteous will be among gardens and fountains, accepting what their Lord has given them.",
        "arabic_text": "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ. آخِذِينَ مَا آتَاهُمْ رَبُّهُمْ",
        "reflection": "This verse connects joy to contentment with divine provision. The righteous experience pleasure not just from the abundance of paradise but from their grateful acceptance of Allah's gifts, demonstrating the relationship between thankfulness and happiness.",
        "verseNumber": 4620,
        "surahNumber": 51,
        "ayahNumber": [
          15,
          16
        ],
        "full_verse": "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ آخِذِينَ مَا آتَاهُمْ رَبُّهُمْ ۚ إِنَّهُمْ كَانُوا قَبْلَ ذَٰلِكَ مُحْسِنِينَ"
      },
      {
        "reference": "Surah Az-Zukhruf 43:70",
        "translation": "Enter Paradise, you and your spouses, rejoicing.",
        "arabic_text": "ادْخُلُوا الْجَنَّةَ أَنتُمْ وَأَزْوَاجُكُمْ تُحْبَرُونَ",
        "reflection": "This verse indicates that paradise is a place of shared joy. The invitation includes spouses, highlighting that legitimate earthly relationships can continue in purified form, contributing to the completeness of heavenly happiness.",
        "verseNumber": 4545,
        "surahNumber": 43,
        "ayahNumber": [
          70
        ],
        "full_verse": "ادْخُلُوا الْجَنَّةَ أَنْتُمْ وَأَزْوَاجُكُمْ تُحْبَرُونَ"
      },
      {
        "reference": "Surah Ad-Duha 93:7",
        "translation": "And He found you lost and guided [you].",
        "arabic_text": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ",
        "reflection": "This verse reminds us of the profound joy that comes from divine guidance. Being led from a state of confusion to clarity by Allah is one of the greatest sources of happiness a believer can experience.",
        "verseNumber": 6095,
        "surahNumber": 93,
        "ayahNumber": [
          7
        ],
        "full_verse": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ"
      },
      {
        "reference": "Surah Ad-Duha 93:5",
        "translation": "And your Lord is going to give you, and you will be satisfied.",
        "arabic_text": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
        "reflection": "This verse promises divine giving that leads to complete satisfaction. It reveals that true joy comes when Allah's generosity meets our deepest needs, creating a state of contentment that transcends material prosperity.",
        "verseNumber": 6093,
        "surahNumber": 93,
        "ayahNumber": [
          5
        ],
        "full_verse": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ"
      }
    ],
    "peace": [
      {
        "reference": "Surah Al-Fajr 89:27-28",
        "translation": "O tranquil soul! Return to your Lord, well-pleased ˹with Him˺ and well-pleasing ˹to Him˺.",
        "arabic_text": "يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ. ارْجِعِي إِلَىٰ رَبِّكِ رَاضِيَةً مَّرْضِيَّةً",
        "reflection": "These verses describe the ultimate peace - a soul so aligned with divine will that it departs this world in a state of mutual pleasure with its Creator. This represents perfect spiritual harmony where the soul finds complete serenity in Allah's presence.",
        "verseNumber": 5952,
        "surahNumber": 89,
        "ayahNumber": [
          27,
          28
        ],
        "full_verse": "يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ ارْجِعِي إِلَىٰ رَبِّكِ رَاضِيَةً مَرْضِيَّةً"
      },
      {
        "reference": "Surah Ash-Sharh 94:5",
        "translation": "So, surely with hardship comes ease.",
        "arabic_text": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا",
        "reflection": "This verse offers peace amid struggles by reframing difficulties as temporary states inevitably paired with relief. Understanding this divine pattern allows believers to maintain tranquility even during challenges, confident that ease is already being prepared.",
        "verseNumber": 6075,
        "surahNumber": 94,
        "ayahNumber": [
          5
        ],
        "full_verse": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا"
      },
      {
        "reference": "Surah Ar-Ra'd 13:28",
        "translation": "Those who believe and whose hearts find comfort in the remembrance of Allah. Truly, in the remembrance of Allah do hearts find comfort.",
        "arabic_text": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
        "reflection": "This verse reveals that peace is not found in external circumstances but in internal connection with Allah. Regular dhikr (remembrance) creates a sanctuary of tranquility within the heart regardless of worldly disturbances.",
        "verseNumber": 3233,
        "surahNumber": 13,
        "ayahNumber": [
          28
        ],
        "full_verse": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ"
      },
      {
        "reference": "Surah Ya-Sin 36:58",
        "translation": "Peace—a word from a Merciful Lord.",
        "arabic_text": "سَلَامٌ قَوْلًا مِّن رَّبٍّ رَّحِيمٍ",
        "reflection": "In paradise, believers will be greeted with \"Salam\" (peace) directly from Allah. This verse shows that peace is not merely the absence of conflict but a positive, divine gift bestowed by the Most Merciful upon His faithful servants.",
        "verseNumber": 3865,
        "surahNumber": 36,
        "ayahNumber": [
          58
        ],
        "full_verse": "سَلَامٌ قَوْلًا مِنْ رَبٍّ رَحِيمٍ"
      },
      {
        "reference": "Surah Yunus 10:25",
        "translation": "And Allah invites to the Home of Peace and guides whom He wills to a straight path.",
        "arabic_text": "وَاللَّهُ يَدْعُو إِلَىٰ دَارِ السَّلَامِ وَيَهْدِي مَن يَشَاءُ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ",
        "reflection": "This verse identifies paradise itself as the \"Home of Peace\" (Dar as-Salam), revealing peace as not just a transient emotion but the essential quality of our eternal destination. Allah actively invites us to this ultimate sanctuary.",
        "verseNumber": 1382,
        "surahNumber": 10,
        "ayahNumber": [
          25
        ],
        "full_verse": "وَاللَّهُ يَدْعُو إِلَىٰ دَارِ السَّلَامِ وَيَهْدِي مَنْ يَشَاءُ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ"
      },
      {
        "reference": "Surah Ad-Duha 93:7",
        "translation": "And He found you lost and guided [you].",
        "arabic_text": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ",
        "reflection": "This verse speaks to the peace that comes from divine guidance. Being lost creates anxiety and distress, while Allah's guidance brings clarity and tranquility. Finding one's spiritual direction establishes inner peace that transcends circumstance.",
        "verseNumber": 6095,
        "surahNumber": 93,
        "ayahNumber": [
          7
        ],
        "full_verse": "وَوَجَدَكَ ضَالًّا فَهَدَىٰ"
      },
      {
        "reference": "Surah Al-Hadid 57:4",
        "translation": "He is with you wherever you are.",
        "arabic_text": "وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ",
        "reflection": "This verse offers profound peace through the assurance of divine companionship. Knowing that Allah is present in every moment and place eliminates the fear of abandonment that often disturbs human tranquility.",
        "verseNumber": 5196,
        "surahNumber": 57,
        "ayahNumber": [
          4
        ],
        "full_verse": "هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ"
      },
      {
        "reference": "Surah Ad-Duha 93:5",
        "translation": "And your Lord is going to give you, and you will be satisfied.",
        "arabic_text": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
        "reflection": "This divine promise brings peace through the assurance of future provision and satisfaction. Anxiety often stems from uncertainty about needs being met, but this verse removes that worry by guaranteeing Allah's generous giving.",
        "verseNumber": 6093,
        "surahNumber": 93,
        "ayahNumber": [
          5
        ],
        "full_verse": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ"
      },
      {
        "reference": "Surah Al-Jumu'ah 62:11",
        "translation": "Say, 'What is with Allah is better than amusement and commerce.'",
        "arabic_text": "قُلْ مَا عِندَ اللَّهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ",
        "reflection": "This verse offers peace by redirecting priorities from worldly distractions to eternal values. Recognizing that divine connection surpasses material pursuits liberates the believer from the anxiety of competitive acquisition.",
        "verseNumber": 5438,
        "surahNumber": 62,
        "ayahNumber": [
          11
        ],
        "full_verse": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ"
      },
      {
        "reference": "Surah Al-Ankabut 29:69",
        "translation": "And those who strive for Us - We will surely guide them to Our ways.",
        "arabic_text": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا",
        "reflection": "This verse brings peace through the certainty of divine guidance for those who sincerely strive. The anxiety of spiritual searching is addressed by Allah's promise to illuminate the path for earnest seekers.",
        "verseNumber": 3509,
        "surahNumber": 29,
        "ayahNumber": [
          69
        ],
        "full_verse": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ"
      },
      {
        "reference": "Surah Al-Furqan 25:31",
        "translation": "And sufficient is your Lord as a guide and a helper.",
        "arabic_text": "وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا",
        "reflection": "This verse establishes peace through complete reliance on Allah. Knowing that the Creator is both guide and helper eliminates the need for anxious self-sufficiency and allows believers to rest in divine support.",
        "verseNumber": 2961,
        "surahNumber": 25,
        "ayahNumber": [
          31
        ],
        "full_verse": "وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِنَ الْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا"
      }
    ],
    "wonder": [
      {
        "reference": "Surah Al-Baqarah 2:164",
        "translation": "Indeed, in the creation of the heavens and the earth, the alternation of the day and night, and the ships that sail the sea for the benefit of humanity...",
        "arabic_text": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنفَعُ النَّاسَ",
        "reflection": "This verse invites contemplation of natural phenomena as signs of Allah's power and wisdom. The wonders of creation - from celestial bodies to weather patterns to human innovations - all point to an intelligent Designer who crafted the universe with purpose.",
        "verseNumber": 171,
        "surahNumber": 2,
        "ayahNumber": [
          164
        ],
        "full_verse": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنْفَعُ النَّاسَ وَمَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ مَاءٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ وَتَصْرِيفِ الرِّيَاحِ وَالسَّحَابِ الْمُسَخَّرِ بَيْنَ السَّمَاءِ وَالْأَرْضِ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ"
      },
      {
        "reference": "Surah Luqman 31:10",
        "translation": "He created the heavens without pillars—as you can see—and placed firm mountains upon the earth so it does not shake with you.",
        "arabic_text": "خَلَقَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ وَأَلْقَىٰ فِي الْأَرْضِ رَوَاسِيَ أَن تَمِيدَ بِكُمْ",
        "reflection": "This verse highlights two extraordinary features of creation that should inspire wonder: the seemingly unsupported expanse of the sky and the stabilizing function of mountains. Both demonstrate Allah's perfect engineering of our habitat for human flourishing.",
        "verseNumber": 3527,
        "surahNumber": 31,
        "ayahNumber": [
          10
        ],
        "full_verse": "خَلَقَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ وَأَلْقَىٰ فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ ۚ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ كَرِيمٍ"
      },
      {
        "reference": "Surah Qaf 50:6",
        "translation": "Have they not looked at the sky above them—how We structured it and adorned it and how it has no rifts?",
        "arabic_text": "أَفَلَمْ يَنظُرُوا إِلَى السَّمَاءِ فَوْقَهُمْ كَيْفَ بَنَيْنَاهَا وَزَيَّنَّاهَا وَمَا لَهَا مِن فُرُوجٍ",
        "reflection": "This verse draws attention to the perfect architecture of the sky - its vastness, stability, and flawless design. By directing our gaze upward, Allah awakens wonder at cosmic precision that defies coincidence and testifies to divine craftsmanship.",
        "verseNumber": 4540,
        "surahNumber": 50,
        "ayahNumber": [
          6
        ],
        "full_verse": "أَفَلَمْ يَنْظُرُوا إِلَى السَّمَاءِ فَوْقَهُمْ كَيْفَ بَنَيْنَاهَا وَزَيَّنَّاهَا وَمَا لَهَا مِنْ فُرُوجٍ"
      },
      {
        "reference": "Surah Al-An'am 6:97",
        "translation": "And it is He who placed for you the stars that you may be guided by them through the darknesses of the land and sea.",
        "arabic_text": "وَهُوَ الَّذِي جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ",
        "reflection": "This verse reveals the practical purpose behind celestial beauty. Stars are not merely decorative but navigational tools, demonstrating Allah's integration of aesthetic wonder with pragmatic function in His design of the cosmos.",
        "verseNumber": 886,
        "surahNumber": 6,
        "ayahNumber": [
          97
        ],
        "full_verse": "وَهُوَ الَّذِي جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ ۗ قَدْ فَصَّلْنَا الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ"
      },
      {
        "reference": "Surah Al-Mulk 67:19",
        "translation": "Do they not see the birds above them, spreading and folding their wings? None holds them up except the Most Compassionate.",
        "arabic_text": "أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ صَافَّاتٍ وَيَقْبِضْنَ ۚ مَا يُمْسِكُهُنَّ إِلَّا الرَّحْمَٰنُ",
        "reflection": "This verse invites wonder at avian flight - a common sight that remains marvelous upon reflection. The seemingly effortless soaring of birds actually depends on Allah's continuous support, revealing divine involvement in what we might mistake as autonomous natural processes.",
        "verseNumber": 5532,
        "surahNumber": 67,
        "ayahNumber": [
          19
        ],
        "full_verse": "أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ صَافَّاتٍ وَيَقْبِضْنَ ۚ مَا يُمْسِكُهُنَّ إِلَّا الرَّحْمَٰنُ ۚ إِنَّهُ بِكُلِّ شَيْءٍ بَصِيرٌ"
      }
    ],
    "contentment": [
      {
        "reference": "Surah At-Tawbah 9:59",
        "translation": "If only they had been content with what Allah and His Messenger had given them, and said, 'Allah is sufficient for us.'",
        "arabic_text": "وَلَوْ أَنَّهُمْ رَضُوا مَا آتَاهُمُ اللَّهُ وَرَسُولُهُ وَقَالُوا حَسْبُنَا اللَّهُ",
        "reflection": "This verse identifies the essence of contentment - recognizing that Allah's provision is sufficient and perfectly tailored to our needs. True satisfaction comes not from having everything but from trusting the wisdom behind what we've been given.",
        "verseNumber": 1270,
        "surahNumber": 9,
        "ayahNumber": [
          59
        ],
        "full_verse": "وَلَوْ أَنَّهُمْ رَضُوا مَا آتَاهُمُ اللَّهُ وَرَسُولُهُ وَقَالُوا حَسْبُنَا اللَّهُ سَيُؤْتِينَا اللَّهُ مِنْ فَضْلِهِ وَرَسُولُهُ إِنَّا إِلَى اللَّهِ رَاغِبُونَ"
      },
      {
        "reference": "Surah Al-Hadid 57:23",
        "translation": "So that you neither grieve over what you have missed nor boast over what He has granted you.",
        "arabic_text": "لِّكَيْلَا تَأْسَوْا عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ",
        "reflection": "This verse describes emotional equilibrium that characterizes contentment. The contented believer neither despairs over losses nor becomes arrogant in success, understanding that all circumstances are temporary tests from Allah.",
        "verseNumber": 5215,
        "surahNumber": 57,
        "ayahNumber": [
          23
        ],
        "full_verse": "لِكَيْلَا تَأْسَوْا عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ"
      },
      {
        "reference": "Surah Al-Haqqah 69:19-20",
        "translation": "But whoever is given his record in his right hand, he will say, 'Here, read my record! Indeed, I was certain that I would meet my accounting.'",
        "arabic_text": "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَيَقُولُ هَاؤُمُ اقْرَءُوا كِتَابِيَهْ ۝ إِنِّي ظَنَنتُ أَنِّي مُلَاقٍ حِسَابِيَهْ",
        "reflection": "This verse depicts the ultimate contentment on Judgment Day when the faithful receive confirmation of their salvation. Their confident acceptance of accountability reflects the peace that comes from living aligned with divine guidance.",
        "verseNumber": 5642,
        "surahNumber": 69,
        "ayahNumber": [
          19,
          20
        ],
        "full_verse": "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَيَقُولُ هَاؤُمُ اقْرَءُوا كِتَابِيَهْ إِنِّي ظَنَنْتُ أَنِّي مُلَاقٍ حِسَابِيَهْ"
      },
      {
        "reference": "Surah Hud 11:115",
        "translation": "And be patient, for indeed, Allah does not allow the reward of the doers of good to be lost.",
        "arabic_text": "وَاصْبِرْ فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ",
        "reflection": "This verse links contentment to certainty about divine justice. Patience becomes easier when we trust that no good deed goes unrewarded, allowing believers to remain satisfied even when immediate results aren't visible.",
        "verseNumber": 1621,
        "surahNumber": 11,
        "ayahNumber": [
          115
        ],
        "full_verse": "وَاصْبِرْ فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ"
      },
      {
        "reference": "Surah An-Nahl 16:32",
        "translation": "The ones whom the angels take in death, [being] good and pure; [the angels] will say, 'Peace be upon you. Enter Paradise for what you used to do.'",
        "arabic_text": "الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ طَيِّبِينَ ۙ يَقُولُونَ سَلَامٌ عَلَيْكُمُ ادْخُلُوا الْجَنَّةَ بِمَا كُنتُمْ تَعْمَلُونَ",
        "reflection": "This verse shows that contentment extends even to the moment of death for believers. Those who lived righteously face this transition with serenity, welcomed by angels who confirm their good standing with their Creator.",
        "verseNumber": 1997,
        "surahNumber": 16,
        "ayahNumber": [
          32
        ],
        "full_verse": "الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ طَيِّبِينَ ۙ يَقُولُونَ سَلَامٌ عَلَيْكُمُ ادْخُلُوا الْجَنَّةَ بِمَا كُنْتُمْ تَعْمَلُونَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:152",
        "translation": "So remember Me; I will remember you.",
        "arabic_text": "فَاذْكُرُونِي أَذْكُرْكُمْ",
        "reflection": "This verse reveals the reciprocal relationship that brings contentment. When believers remember Allah, He remembers them - a divine exchange that fulfills the deepest human need for recognition and value from their Creator.",
        "verseNumber": 159,
        "surahNumber": 2,
        "ayahNumber": [
          152
        ],
        "full_verse": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ"
      },
      {
        "reference": "Surah Ad-Duha 93:5",
        "translation": "And your Lord is going to give you, and you will be satisfied.",
        "arabic_text": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
        "reflection": "This verse directly addresses contentment through divine provision. Allah promises not just to give, but to give until complete satisfaction is reached - a remarkable assurance that our deepest longings will be fulfilled.",
        "verseNumber": 6093,
        "surahNumber": 93,
        "ayahNumber": [
          5
        ],
        "full_verse": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ"
      },
      {
        "reference": "Surah Al-Jumu'ah 62:11",
        "translation": "Say, 'What is with Allah is better than amusement and commerce.'",
        "arabic_text": "قُلْ مَا عِندَ اللَّهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ",
        "reflection": "This verse establishes contentment through proper valuation. By recognizing that Allah's rewards are superior to worldly pleasures and gains, believers can find satisfaction in spiritual pursuits rather than endless material acquisition.",
        "verseNumber": 5438,
        "surahNumber": 62,
        "ayahNumber": [
          11
        ],
        "full_verse": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ"
      },
      {
        "reference": "Surah Al-Furqan 25:31",
        "translation": "And sufficient is your Lord as a guide and a helper.",
        "arabic_text": "وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا",
        "reflection": "This verse encapsulates contentment in the word 'sufficient.' When we truly believe that Allah's guidance and help are enough, we no longer feel lacking or insecure regardless of our earthly circumstances.",
        "verseNumber": 2961,
        "surahNumber": 25,
        "ayahNumber": [
          31
        ],
        "full_verse": "وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِنَ الْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا"
      }
    ],
    "forgiveness": [
      {
        "reference": "Surah Ali 'Imran 3:135",
        "arabic_text": "وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنفُسَهُمْ ذَكَرُوا اللَّهَ فَاسْتَغْفَرُوا لِذُنُوبِهِمْ",
        "translation": "Those who, when they commit a shameful deed or wrong themselves, remember Allah and seek forgiveness for their sins.",
        "reflection": "This verse describes the distinguishing feature of righteous believers - not that they never sin, but that they immediately turn to Allah in repentance when they do. It establishes seeking forgiveness as an essential quality of faith rather than a sign of weakness.",
        "verseNumber": 446,
        "surahNumber": 3,
        "ayahNumber": [
          135
        ],
        "full_verse": "وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ فَاسْتَغْفَرُوا لِذُنُوبِهِمْ وَمَنْ يَغْفِرُ الذُّنُوبَ إِلَّا اللَّهُ وَلَمْ يُصِرُّوا عَلَىٰ مَا فَعَلُوا وَهُمْ يَعْلَمُونَ"
      },
      {
        "reference": "Surah Az-Zumar 39:53",
        "arabic_text": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا",
        "translation": "Say, ˹O Prophet, that Allah says,˺ 'O My servants who have exceeded the limits against their souls! Do not lose hope in Allah's mercy. Surely Allah forgives all sins.'",
        "reflection": "This verse opens the door of forgiveness even to those who have committed major sins repeatedly. It challenges our tendency to quantify sin and emphasizes that Allah's capacity to forgive exceeds our capacity to sin.",
        "verseNumber": 4212,
        "surahNumber": 39,
        "ayahNumber": [
          53
        ],
        "full_verse": "۞ قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ"
      },
      {
        "reference": "Surah An-Nisa 4:110",
        "arabic_text": "وَمَن يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّهَ يَجِدِ اللَّهَ غَفُورًا رَّحِيمًا",
        "translation": "And whoever does a wrong or wrongs himself but then seeks forgiveness of Allah will find Allah Forgiving and Merciful.",
        "reflection": "This verse establishes a direct cause-and-effect relationship between seeking forgiveness and receiving it. Allah promises that anyone who turns to Him in sincere repentance will encounter not rejection but divine mercy and forgiveness.",
        "verseNumber": 603,
        "surahNumber": 4,
        "ayahNumber": [
          110
        ],
        "full_verse": "وَمَنْ يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّهَ يَجِدِ اللَّهَ غَفُورًا رَحِيمًا"
      },
      {
        "reference": "Surah Al-An'am 6:54",
        "arabic_text": "كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ",
        "translation": "Your Lord has decreed upon Himself mercy: that any of you who does wrong out of ignorance and then repents after that and corrects himself—indeed, He is Forgiving and Merciful.",
        "reflection": "This verse reveals Allah's self-imposed commitment to mercy. By \"decreeing upon Himself\" forgiveness for the repentant, Allah demonstrates that pardoning sinners is not reluctant concession but a loving expression of His essential nature.",
        "verseNumber": 843,
        "surahNumber": 6,
        "ayahNumber": [
          54
        ],
        "full_verse": "وَإِذَا جَاءَكَ الَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا فَقُلْ سَلَامٌ عَلَيْكُمْ ۖ كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ ۖ أَنَّهُ مَنْ عَمِلَ مِنْكُمْ سُوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَحِيمٌ"
      },
      {
        "reference": "Surah Ta-Ha 20:82",
        "arabic_text": "وَإِنِّي لَغَفَّارٌ لِّمَن تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَىٰ",
        "translation": "But indeed, I am the Perpetual Forgiver of whoever repents and believes and does righteousness and then continues in guidance.",
        "reflection": "This verse outlines the comprehensive path to forgiveness - repentance followed by faith, righteous action, and continued adherence to guidance. Allah's forgiveness is not just for past sins but supports ongoing spiritual development.",
        "verseNumber": 2560,
        "surahNumber": 20,
        "ayahNumber": [
          82
        ],
        "full_verse": "وَإِنِّي لَغَفَّارٌ لِمَنْ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَىٰ"
      },
      {
        "reference": "Surah Al-Anfal 8:33",
        "arabic_text": "وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ ۚ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ",
        "translation": "But Allah would not punish them while you are among them, and Allah would not punish them while they seek forgiveness.",
        "reflection": "This verse highlights the power of seeking forgiveness as a shield against punishment, showing that sincere repentance can avert divine wrath and open the door to mercy.",
        "verseNumber": 1152,
        "surahNumber": 8,
        "ayahNumber": [
          33
        ],
        "full_verse": "وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ ۚ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:263",
        "arabic_text": "قَوْلٌ مَّعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ مِّن صَدَقَةٍ يَتْبَعُهَا أَذًى",
        "translation": "Kind speech and forgiveness are better than charity followed by injury.",
        "reflection": "This verse elevates forgiveness as a virtue that exceeds even charity when the latter is accompanied by hurtful reminders. It emphasizes that the spirit in which we act is as important as the action itself.",
        "verseNumber": 270,
        "surahNumber": 2,
        "ayahNumber": [
          263
        ],
        "full_verse": "۞ قَوْلٌ مَعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ مِنْ صَدَقَةٍ يَتْبَعُهَا أَذًى ۗ وَاللَّهُ غَنِيٌّ حَلِيمٌ"
      }
    ],
    "loneliness": [
      {
        "reference": "Surah Al-Baqarah 2:186",
        "arabic_text": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ",
        "translation": "When My servants ask you ˹O Prophet˺ about Me, I am truly near. I respond to one's prayer when they call upon Me.",
        "reflection": "This verse addresses the fundamental human fear of cosmic loneliness. Allah reassures us of His constant presence without intermediaries - He is not distant or inaccessible but intimately aware of and responsive to our supplications.",
        "verseNumber": 193,
        "surahNumber": 2,
        "ayahNumber": [
          186
        ],
        "full_verse": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ"
      },
      {
        "reference": "Surah Qaf 50:16",
        "arabic_text": "وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ",
        "translation": "And We are closer to one than ˹their˺ jugular vein.",
        "reflection": "This powerful metaphor illustrates Allah's proximity - He is closer to us than our own life-sustaining blood vessels. Even in moments of complete isolation from other humans, the believer is never truly alone because the Creator's presence permeates our very being.",
        "verseNumber": 4550,
        "surahNumber": 50,
        "ayahNumber": [
          16
        ],
        "full_verse": "وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ"
      },
      {
        "reference": "Surah Al-Mujadilah 58:7",
        "arabic_text": "مَا يَكُونُ مِن نَّجْوَىٰ ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ",
        "translation": "There is in no private conversation three but that He is the fourth of them.",
        "reflection": "This verse eliminates the possibility of absolute solitude. Even in the most intimate conversations, Allah is present as an aware participant. This divine attendance can transform loneliness from deprivation to privileged communion with the Creator.",
        "verseNumber": 5228,
        "surahNumber": 58,
        "ayahNumber": [
          7
        ],
        "full_verse": "أَلَمْ تَرَ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ مَا يَكُونُ مِنْ نَجْوَىٰ ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَىٰ مِنْ ذَٰلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا ۖ ثُمَّ يُنَبِّئُهُمْ بِمَا عَمِلُوا يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ"
      },
      {
        "reference": "Surah Al-Hadid 57:4",
        "arabic_text": "وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
        "translation": "And He is with you wherever you are. And Allah, of what you do, is Seeing.",
        "reflection": "This verse eliminates the possibility of absolute solitude. Regardless of physical location or social circumstances, Allah's watchful companionship remains constant. This awareness can transform loneliness from abandonment to intimate divine observation.",
        "verseNumber": 5196,
        "surahNumber": 57,
        "ayahNumber": [
          4
        ],
        "full_verse": "هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ"
      },
      {
        "reference": "Surah Al-Insan 76:1",
        "arabic_text": "هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ لَمْ يَكُن شَيْئًا مَّذْكُورًا",
        "translation": "Has there [not] come upon man a period of time when he was not a thing [even] mentioned?",
        "reflection": "This verse reminds us of our origin in non-existence, when Allah alone knew of our future being. This perspective helps counter loneliness by emphasizing the miracle of our creation and the constant attention of the One who brought us from nothingness into life.",
        "verseNumber": 5743,
        "surahNumber": 76,
        "ayahNumber": [
          1
        ],
        "full_verse": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ هَلْ أَتَىٰ عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا"
      },
      {
        "reference": "Surah Al-Anfal 8:46",
        "arabic_text": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "translation": "And obey Allah and His Messenger, and do not dispute and [thus] lose courage and [then] your strength would depart; and be patient. Indeed, Allah is with the patient.",
        "reflection": "This verse reminds believers that unity and patience bring divine companionship. By emphasizing that 'Allah is with the patient,' it assures us that enduring difficult times with steadfastness ensures we are never truly alone.",
        "verseNumber": 1165,
        "surahNumber": 8,
        "ayahNumber": [
          46
        ],
        "full_verse": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:153",
        "arabic_text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "translation": "O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.",
        "reflection": "This verse offers two powerful remedies for loneliness - patience and prayer. It reassures believers that maintaining steadfastness in difficulties guarantees divine companionship, transforming isolation into an opportunity for spiritual intimacy.",
        "verseNumber": 160,
        "surahNumber": 2,
        "ayahNumber": [
          153
        ],
        "full_verse": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-Ankabut 29:69",
        "arabic_text": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ",
        "translation": "And those who strive for Us - We will surely guide them to Our ways. And indeed, Allah is with the doers of good.",
        "reflection": "This verse promises divine companionship to those who strive in His cause and do good. It reminds us that active engagement with righteous purposes connects us directly to Allah's guidance and presence.",
        "verseNumber": 3511,
        "surahNumber": 29,
        "ayahNumber": [
          69
        ],
        "full_verse": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ"
      }
    ],
    "courage": [
      {
        "reference": "Surah Al-Baqarah 2:249",
        "arabic_text": "كَم مِّن فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصَّابِرِينَ",
        "translation": "How many times has a small group overcome a mighty army by Allah's permission. And Allah is with those who are patient.",
        "reflection": "This verse recounts historical examples of seemingly impossible victories granted to faithful minorities. It inspires courage by shifting focus from apparent power imbalances to the decisive factor: Allah's support for those who persevere in His cause.",
        "verseNumber": 256,
        "surahNumber": 2,
        "ayahNumber": [
          249
        ],
        "full_verse": "فَلَمَّا فَصَلَ طَالُوتُ بِالْجُنُودِ قَالَ إِنَّ اللَّهَ مُبْتَلِيكُمْ بِنَهَرٍ فَمَنْ شَرِبَ مِنْهُ فَلَيْسَ مِنِّي وَمَنْ لَمْ يَطْعَمْهُ فَإِنَّهُ مِنِّي إِلَّا مَنِ اغْتَرَفَ غُرْفَةً بِيَدِهِ ۚ فَشَرِبُوا مِنْهُ إِلَّا قَلِيلًا مِنْهُمْ ۚ فَلَمَّا جَاوَزَهُ هُوَ وَالَّذِينَ آمَنُوا مَعَهُ قَالُوا لَا طَاقَةَ لَنَا الْيَوْمَ بِجَالُوتَ وَجُنُودِهِ ۚ قَالَ الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو اللَّهِ كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-Anfal 8:10",
        "arabic_text": "وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ ۚ وَمَا النَّصْرُ إِلَّا مِنْ عِندِ اللَّهِ",
        "translation": "Allah made this a reassurance to your hearts. Victory comes only from Allah.",
        "reflection": "This verse, referring to divine reinforcement at Badr, locates the source of courage in understanding that victory ultimately depends on Allah rather than material resources. This perspective transforms anxiety into calm determination regardless of apparent disadvantages.",
        "verseNumber": 1129,
        "surahNumber": 8,
        "ayahNumber": [
          10
        ],
        "full_verse": "وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ ۚ وَمَا النَّصْرُ إِلَّا مِنْ عِنْدِ اللَّهِ ۚ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ"
      },
      {
        "reference": "Surah Al-A'raf 7:128",
        "arabic_text": "قَالَ مُوسَىٰ لِقَوْمِهِ اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا ۖ إِنَّ الْأَرْضَ لِلَّهِ يُورِثُهَا مَن يَشَاءُ مِنْ عِبَادِهِ",
        "translation": "And Moses said to his people, 'Seek help through Allah and be patient. Indeed, the earth belongs to Allah. He causes to inherit it whom He wills of His servants.'",
        "reflection": "This verse shows Prophet Musa inspiring courage in his oppressed people by redirecting their focus from Pharaoh's power to Allah's sovereignty. True courage emerges from recognizing that apparent human authority is subordinate to divine ownership of all creation.",
        "verseNumber": 996,
        "surahNumber": 7,
        "ayahNumber": [
          128
        ],
        "full_verse": "قَالَ مُوسَىٰ لِقَوْمِهِ اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا ۖ إِنَّ الْأَرْضَ لِلَّهِ يُورِثُهَا مَنْ يَشَاءُ مِنْ عِبَادِهِ ۖ وَالْعَاقِبَةُ لِلْمُتَّقِينَ"
      },
      {
        "reference": "Surah Ali 'Imran 3:139",
        "arabic_text": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
        "translation": "So do not weaken and do not grieve, and you will be superior if you are [true] believers.",
        "reflection": "This verse directly connects faith to courage. The imperative \"do not weaken\" indicates that maintaining strength in adversity is a conscious choice believers must make, supported by their conviction in Allah's ultimate justice and support.",
        "verseNumber": 450,
        "surahNumber": 3,
        "ayahNumber": [
          139
        ],
        "full_verse": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنْتُمُ الْأَعْلَوْنَ إِنْ كُنْتُمْ مُؤْمِنِينَ"
      },
      {
        "reference": "Surah Ali 'Imran 3:173",
        "arabic_text": "الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
        "translation": "Indeed, those to whom the people said, 'Indeed, the people have gathered against you, so fear them.' But it [merely] increased them in faith, and they said, 'Sufficient for us is Allah, and [He is] the best Disposer of affairs.'",
        "reflection": "This verse describes the ideal response to intimidation - not denial of danger but transcendence through trust in Allah. True courage isn't fearlessness but faith that transforms threats into opportunities for spiritual growth.",
        "verseNumber": 484,
        "surahNumber": 3,
        "ayahNumber": [
          173
        ],
        "full_verse": "الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ"
      },
      {
        "reference": "Surah Ta-Ha 20:46",
        "arabic_text": "قَالَ لَا تَخَافَا ۖ إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ",
        "translation": "Allah said, 'Fear not. Indeed, I am with you both; I hear and I see.'",
        "reflection": "This verse captures Allah's reassurance to Moses and Aaron as they prepare to confront Pharaoh. The divine presence transforms their fear into courage, showing that awareness of Allah's watchful support is the ultimate source of strength in challenging situations.",
        "verseNumber": 2524,
        "surahNumber": 20,
        "ayahNumber": [
          46
        ],
        "full_verse": "قَالَ لَا تَخَافَا ۖ إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ"
      },
      {
        "reference": "Surah Al-Baqarah 2:286",
        "arabic_text": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا",
        "translation": "Allah does not burden a soul beyond that it can bear.",
        "reflection": "This verse offers profound reassurance that fuels courage by guaranteeing that every trial we face is calibrated to our capacity. Knowing that Allah has measured our challenges against our strength gives believers confidence to face seemingly overwhelming difficulties.",
        "verseNumber": 293,
        "surahNumber": 2,
        "ayahNumber": [
          286
        ],
        "full_verse": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:152",
        "arabic_text": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
        "translation": "So remember Me; I will remember you. And be grateful to Me and do not deny Me.",
        "reflection": "This verse reveals a direct relationship between remembering Allah and being remembered by Him. This divine attention provides the ultimate source of courage, as believers face challenges knowing they are not forgotten but actively remembered by their Creator.",
        "verseNumber": 159,
        "surahNumber": 2,
        "ayahNumber": [
          152
        ],
        "full_verse": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ"
      },
      {
        "reference": "Surah At-Tawbah 9:40",
        "arabic_text": "إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
        "translation": "When he said to his companion, 'Do not grieve; indeed Allah is with us.'",
        "reflection": "This verse recalls Prophet Muhammad's reassurance to Abu Bakr in the cave while being pursued. It demonstrates that courage comes from certainty in divine companionship, which transforms even life-threatening situations into opportunities to witness Allah's protection.",
        "verseNumber": 1350,
        "surahNumber": 9,
        "ayahNumber": [
          40
        ],
        "full_verse": "إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ"
      }
    ],
    "healing": [
      {
        "reference": "Surah Ash-Shu'ara 26:80",
        "arabic_text": "وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ",
        "translation": "And when I am ill, He ˹alone˺ heals me.",
        "reflection": "Spoken by Prophet Ibrahim, this verse acknowledges Allah as the ultimate source of healing. While we pursue medical treatment, this verse reminds us that medicines and doctors are merely instruments through which Allah's healing power operates.",
        "verseNumber": 3034,
        "surahNumber": 26,
        "ayahNumber": [
          80
        ],
        "full_verse": "وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ"
      },
      {
        "reference": "Surah Al-Isra 17:82",
        "arabic_text": "وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ",
        "translation": "We send down the Quran as a healing and mercy for the believers.",
        "reflection": "This verse reveals the therapeutic power of divine revelation. The Quran provides healing not only through specific ruqyah (healing verses) but through its comprehensive guidance that addresses the root causes of spiritual, emotional, and social diseases.",
        "verseNumber": 2189,
        "surahNumber": 17,
        "ayahNumber": [
          82
        ],
        "full_verse": "وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ ۙ وَلَا يَزِيدُ الظَّالِمِينَ إِلَّا خَسَارًا"
      },
      {
        "reference": "Surah Yunus 10:57",
        "arabic_text": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَتْكُم مَّوْعِظَةٌ مِّن رَّبِّكُمْ وَشِفَاءٌ لِّمَا فِي الصُّدُورِ",
        "translation": "O humanity! There has come to you a good advice from your Lord and a healing for what is in the hearts.",
        "reflection": "This verse specifies that the Quran particularly heals \"what is in the hearts\" - the inner ailments of doubt, hypocrisy, malice, and spiritual emptiness that often underlie physical symptoms and cannot be treated by conventional medicine.",
        "verseNumber": 1414,
        "surahNumber": 10,
        "ayahNumber": [
          57
        ],
        "full_verse": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَتْكُمْ مَوْعِظَةٌ مِنْ رَبِّكُمْ وَشِفَاءٌ لِمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِلْمُؤْمِنِينَ"
      },
      {
        "reference": "Surah Fussilat 41:44",
        "arabic_text": "قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ",
        "translation": "Say, 'It is, for those who believe, a guidance and cure.'",
        "reflection": "This verse reveals that the healing power of the Quran is activated by faith. The same divine words that cure believers may not affect those who approach the text with skepticism or hostility, demonstrating that receptivity to spiritual healing requires openness to divine authority.",
        "verseNumber": 4390,
        "surahNumber": 41,
        "ayahNumber": [
          44
        ],
        "full_verse": "وَلَوْ جَعَلْنَاهُ قُرْآنًا أَعْجَمِيًّا لَقَالُوا لَوْلَا فُصِّلَتْ آيَاتُهُ ۖ أَأَعْجَمِيٌّ وَعَرَبِيٌّ ۗ قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ ۖ وَالَّذِينَ لَا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى ۚ أُولَٰئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ"
      },
      {
        "reference": "Surah An-Nahl 16:69",
        "arabic_text": "يَخْرُجُ مِن بُطُونِهَا شَرَابٌ مُّخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِلنَّاسِ",
        "translation": "There emerges from their bellies a drink, varying in colors, in which there is healing for people.",
        "reflection": "This verse referring to honey highlights that Allah has placed healing properties within His creation. Natural substances can contain medicinal benefits as part of divine design, encouraging believers to appreciate both spiritual and physical remedies as gifts from Allah.",
        "verseNumber": 2034,
        "surahNumber": 16,
        "ayahNumber": [
          69
        ],
        "full_verse": "ثُمَّ كُلِي مِنْ كُلِّ الثَّمَرَاتِ فَاسْلُكِي سُبُلَ رَبِّكِ ذُلُلًا ۚ يَخْرُجُ مِنْ بُطُونِهَا شَرَابٌ مُخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِلنَّاسِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَتَفَكَّرُونَ"
      },
      {
        "reference": "Surah Ad-Duha 93:4",
        "arabic_text": "وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ",
        "translation": "And the Hereafter is better for you than the first [life].",
        "reflection": "This verse offers emotional and spiritual healing by redirecting focus from temporary worldly afflictions to the eternal rewards awaiting believers. It provides perspective that can transform suffering from meaningless pain to purposeful testing with promised compensation.",
        "verseNumber": 6232,
        "surahNumber": 93,
        "ayahNumber": [
          4
        ],
        "full_verse": "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ"
      },
      {
        "reference": "Surah Al-Jumu'ah 62:11",
        "arabic_text": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِندَ اللَّهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ",
        "translation": "Say, 'What is with Allah is better than amusement and commerce.'",
        "reflection": "This verse offers healing for the soul's constant search for fulfillment through material pursuits. It reminds that lasting satisfaction and healing from worldly anxieties comes through prioritizing divine connection over temporary distractions.",
        "verseNumber": 5420,
        "surahNumber": 62,
        "ayahNumber": [
          11
        ],
        "full_verse": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ"
      }
    ],
    "reflection": [
      {
        "reference": "Surah Al-Hashr 59:18",
        "arabic_text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ",
        "translation": "O you who believe! Fear Allah and let every soul look to what it has sent forth for tomorrow.",
        "reflection": "This verse calls believers to self-examination and accountability, encouraging us to reflect on our actions and their consequences before the Day of Judgment. Regular introspection keeps us mindful of our purpose.",
        "verseNumber": 5282,
        "surahNumber": 59,
        "ayahNumber": [
          18
        ],
        "full_verse": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ"
      },
      {
        "reference": "Surah Al-A'raf 7:176",
        "arabic_text": "فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ يَتَفَكَّرُونَ",
        "translation": "So relate the stories that perhaps they will give thought.",
        "reflection": "Allah emphasizes the importance of contemplating stories and parables as a means of gaining wisdom. Reflection on narratives allows us to extract deeper meanings and apply lessons to our own lives.",
        "verseNumber": 1044,
        "surahNumber": 7,
        "ayahNumber": [
          176
        ],
        "full_verse": "وَلَوْ شِئْنَا لَرَفَعْنَاهُ بِهَا وَلَٰكِنَّهُ أَخْلَدَ إِلَى الْأَرْضِ وَاتَّبَعَ هَوَاهُ ۚ فَمَثَلُهُ كَمَثَلِ الْكَلْبِ إِنْ تَحْمِلْ عَلَيْهِ يَلْهَثْ أَوْ تَتْرُكْهُ يَلْهَثْ ۚ ذَٰلِكَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۚ فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ يَتَفَكَّرُونَ"
      },
      {
        "reference": "Surah Az-Zumar 39:42",
        "arabic_text": "اللَّهُ يَتَوَفَّى الْأَنفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا",
        "translation": "Allah takes the souls at the time of their death, and those that do not die [He takes] during their sleep.",
        "reflection": "This verse invites reflection on the temporary nature of sleep as a reminder of death, encouraging contemplation of our mortality and ultimate return to Allah.",
        "verseNumber": 4201,
        "surahNumber": 39,
        "ayahNumber": [
          42
        ],
        "full_verse": "اللَّهُ يَتَوَفَّى الْأَنْفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا ۖ فَيُمْسِكُ الَّتِي قَضَىٰ عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْأُخْرَىٰ إِلَىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ"
      },
      {
        "reference": "Surah Al-Rum 30:8",
        "arabic_text": "أَوَلَمْ يَتَفَكَّرُوا فِي أَنفُسِهِمْ",
        "translation": "Do they not reflect upon themselves?",
        "reflection": "A direct call to self-reflection, reminding us that understanding our inner selves is essential to recognizing Allah's signs and developing spiritual awareness.",
        "verseNumber": 3463,
        "surahNumber": 30,
        "ayahNumber": [
          8
        ],
        "full_verse": "أَوَلَمْ يَتَفَكَّرُوا فِي أَنْفُسِهِمْ ۗ مَا خَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُسَمًّى ۗ وَإِنَّ كَثِيرًا مِنَ النَّاسِ بِلِقَاءِ رَبِّهِمْ لَكَافِرُونَ"
      },
      {
        "reference": "Surah Yunus 10:24",
        "arabic_text": "كَذَٰلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَتَفَكَّرُونَ",
        "translation": "Thus do We explain in detail the signs for a people who give thought.",
        "reflection": "Allah repeatedly draws attention to natural phenomena as signs, but their significance is only grasped by those who take time to reflect deeply on their meaning.",
        "verseNumber": 1381,
        "surahNumber": 10,
        "ayahNumber": [
          24
        ],
        "full_verse": "إِنَّمَا مَثَلُ الْحَيَاةِ الدُّنْيَا كَمَاءٍ أَنْزَلْنَاهُ مِنَ السَّمَاءِ فَاخْتَلَطَ بِهِ نَبَاتُ الْأَرْضِ مِمَّا يَأْكُلُ النَّاسُ وَالْأَنْعَامُ حَتَّىٰ إِذَا أَخَذَتِ الْأَرْضُ زُخْرُفَهَا وَازَّيَّنَتْ وَظَنَّ أَهْلُهَا أَنَّهُمْ قَادِرُونَ عَلَيْهَا أَتَاهَا أَمْرُنَا لَيْلًا أَوْ نَهَارًا فَجَعَلْنَاهَا حَصِيدًا كَأَنْ لَمْ تَغْنَ بِالْأَمْسِ ۚ كَذَٰلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَتَفَكَّرُونَ"
      },
      {
        "reference": "Surah An-Nahl 16:125",
        "arabic_text": "ادْعُ إِلَىٰ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ ۖ وَجَادِلْهُم بِالَّتِي هِيَ أَحْسَنُ",
        "translation": "Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best.",
        "reflection": "This verse teaches the importance of thoughtful reflection before communication, encouraging believers to approach discussions with wisdom and beautiful preaching rather than harshness.",
        "verseNumber": 2126,
        "surahNumber": 16,
        "ayahNumber": [
          125
        ],
        "full_verse": "ادْعُ إِلَىٰ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ ۖ وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ ۚ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ ۖ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ"
      },
      {
        "reference": "Surah Al-Ma'idah 5:8",
        "arabic_text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا ۚ اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ",
        "translation": "O you who have believed, be persistently standing firm for Allah, witnesses in justice, and do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness.",
        "reflection": "This verse calls for deep reflection on our motivations and actions, especially when dealing with those we may dislike, emphasizing that true righteousness comes from maintaining justice regardless of personal feelings.",
        "verseNumber": 677,
        "surahNumber": 5,
        "ayahNumber": [
          8
        ],
        "full_verse": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا ۚ اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ"
      },
      {
        "reference": "Surah Al-A'raf 7:199",
        "arabic_text": "خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ",
        "translation": "Take what is given freely, enjoin what is good, and turn away from the ignorant.",
        "reflection": "This concise verse invites reflection on three aspects of wise conduct: accepting what comes with ease, promoting goodness, and avoiding pointless arguments with those unwilling to understand.",
        "verseNumber": 1067,
        "surahNumber": 7,
        "ayahNumber": [
          199
        ],
        "full_verse": "خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ"
      }
    ],
    "patience": [
      {
        "reference": "Surah Al-Baqarah 2:153",
        "arabic_text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "translation": "O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.",
        "reflection": "This verse pairs patience with prayer as the believer's primary tools for overcoming difficulty, promising Allah's special companionship to those who persevere.",
        "verseNumber": 160,
        "surahNumber": 2,
        "ayahNumber": [
          153
        ],
        "full_verse": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-Asr 103:1-3",
        "arabic_text": "وَالْعَصْرِ ۝ إِنَّ الْإِنسَانَ لَفِي خُسْرٍ ۝ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ",
        "translation": "By time, indeed, mankind is in loss, except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience.",
        "reflection": "Patience is highlighted as one of the four essential qualities that save humanity from loss, emphasizing its centrality to the believer's character.",
        "verseNumber": 6238,
        "surahNumber": 103,
        "ayahNumber": [
          1,
          2,
          3
        ],
        "full_verse": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ وَالْعَصْرِ إِنَّ الْإِنْسَانَ لَفِي خُسْرٍ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ"
      },
      {
        "reference": "Surah Al-Anfal 8:46",
        "arabic_text": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
        "translation": "And obey Allah and His Messenger, and do not dispute and [thus] lose courage and [then] your strength would depart; and be patient. Indeed, Allah is with the patient.",
        "reflection": "Patience is presented as a source of strength and unity, with Allah's support explicitly tied to the quality of patience.",
        "verseNumber": 1165,
        "surahNumber": 8,
        "ayahNumber": [
          46
        ],
        "full_verse": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Ali 'Imran 3:200",
        "arabic_text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
        "translation": "O you who have believed, persevere and endure and remain stationed and fear Allah that you may be successful.",
        "reflection": "This verse presents multiple dimensions of patience: perseverance through difficulties, endurance against enemies, and steadfastness in faith—all leading to ultimate success.",
        "verseNumber": 511,
        "surahNumber": 3,
        "ayahNumber": [
          200
        ],
        "full_verse": "يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ"
      },
      {
        "reference": "Surah Al-Mu'minun 23:111",
        "arabic_text": "إِنِّي جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوا أَنَّهُمْ هُمُ الْفَائِزُونَ",
        "translation": "Indeed, I have rewarded them this Day for their patient endurance - they are indeed the achievers [of success].",
        "reflection": "Allah confirms that patience will be specifically rewarded, with the patient ones described as the true achievers of ultimate success in the Hereafter.",
        "verseNumber": 2784,
        "surahNumber": 23,
        "ayahNumber": [
          111
        ],
        "full_verse": "إِنِّي جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوا أَنَّهُمْ هُمُ الْفَائِزُونَ"
      },
      {
        "reference": "Surah An-Nahl 16:127",
        "arabic_text": "وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ",
        "translation": "And be patient, and your patience is not but through Allah.",
        "reflection": "This verse reminds us that true patience comes only with Allah's help, teaching that we should rely on divine support rather than our own limited strength when facing trials.",
        "verseNumber": 2128,
        "surahNumber": 16,
        "ayahNumber": [
          127
        ],
        "full_verse": "وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:286",
        "arabic_text": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا",
        "translation": "Allah does not burden a soul beyond that it can bear.",
        "reflection": "This reassurance forms the foundation of patient endurance, reminding believers that whatever trial they face, Allah has already measured it according to their capacity.",
        "verseNumber": 293,
        "surahNumber": 2,
        "ayahNumber": [
          286
        ],
        "full_verse": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ"
      },
      {
        "reference": "Surah Ad-Duha 93:4",
        "arabic_text": "وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ",
        "translation": "And the Hereafter is better for you than the first [life].",
        "reflection": "This verse encourages patience through worldly trials by reminding believers that permanent relief and reward await in the afterlife, which far surpasses any temporary worldly comfort.",
        "verseNumber": 6093,
        "surahNumber": 93,
        "ayahNumber": [
          4
        ],
        "full_verse": "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ"
      },
      {
        "reference": "Surah Ar-Rum 30:60",
        "arabic_text": "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ وَلَا يَسْتَخِفَّنَّكَ الَّذِينَ لَا يُوقِنُونَ",
        "translation": "So be patient. Indeed, the promise of Allah is truth. And let not those who have no certainty disquiet you.",
        "reflection": "This verse connects patience with firm belief in Allah's promises, teaching that certainty in divine promises gives strength to remain patient even when surrounded by doubt.",
        "verseNumber": 3515,
        "surahNumber": 30,
        "ayahNumber": [
          60
        ],
        "full_verse": "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ وَلَا يَسْتَخِفَّنَّكَ الَّذِينَ لَا يُوقِنُونَ"
      },
      {
        "reference": "Surah Az-Zumar 39:10",
        "arabic_text": "إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ",
        "translation": "Indeed, the patient will be given their reward without account [i.e., limitation].",
        "reflection": "This powerful statement promises unlimited rewards for patience, highlighting it as one of the most valued qualities in Allah's sight.",
        "verseNumber": 4169,
        "surahNumber": 39,
        "ayahNumber": [
          10
        ],
        "full_verse": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ"
      },
      {
        "reference": "Surah An-Nahl 16:126",
        "arabic_text": "وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُم بِهِ ۖ وَلَئِن صَبَرْتُمْ لَهُوَ خَيْرٌ لِّلصَّابِرِينَ",
        "translation": "And if you punish [an enemy], punish with an equivalent of that with which you were harmed. But if you are patient - it is better for those who are patient.",
        "reflection": "This verse teaches that while justice is permissible, patience and forgiveness are superior, showing that restraint in the face of harm reflects spiritual strength rather than weakness.",
        "verseNumber": 2127,
        "surahNumber": 16,
        "ayahNumber": [
          126
        ],
        "full_verse": "وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُمْ بِهِ ۖ وَلَئِنْ صَبَرْتُمْ لَهُوَ خَيْرٌ لِلصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-Furqan 25:75",
        "arabic_text": "أُولَٰئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ فِيهَا تَحِيَّةً وَسَلَامًا",
        "translation": "Those will be awarded the Chamber for what they patiently endured, and they will be received therein with greetings and [words of] peace.",
        "reflection": "This verse depicts the magnificent reward of paradise specifically linked to patience, illustrating how temporary endurance leads to eternal peace and honor.",
        "verseNumber": 2945,
        "surahNumber": 25,
        "ayahNumber": [
          75
        ],
        "full_verse": "أُولَٰئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ فِيهَا تَحِيَّةً وَسَلَامًا"
      }
    ],
    "love": [
      {
        "reference": "Surah Al-Rum 30:21",
        "arabic_text": "وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا لِّتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُم مَّوَدَّةً وَرَحْمَةً",
        "translation": "And of His signs is that He created for you from yourselves mates that you may find tranquility in them; and He placed between you affection and mercy.",
        "reflection": "This verse describes how Allah instilled love and mercy between spouses as divine gifts, showing that genuine love is a sign of Allah's presence in our relationships.",
        "verseNumber": 3476,
        "surahNumber": 30,
        "ayahNumber": [
          21
        ],
        "full_verse": "وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا لِتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُمْ مَوَدَّةً وَرَحْمَةً ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ"
      },
      {
        "reference": "Surah Al-Ma'idah 5:54",
        "arabic_text": "يُحِبُّهُمْ وَيُحِبُّونَهُ",
        "translation": "He loves them and they love Him.",
        "reflection": "This profound statement describes the reciprocal love between Allah and believers, emphasizing that the highest form of love is that exchanged between the Creator and His devoted servants.",
        "verseNumber": 723,
        "surahNumber": 5,
        "ayahNumber": [
          54
        ],
        "full_verse": "يَا أَيُّهَا الَّذِينَ آمَنُوا مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دِينِهِ فَسَوْفَ يَأْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ عَلَى الْكَافِرِينَ يُجَاهِدُونَ فِي سَبِيلِ اللَّهِ وَلَا يَخَافُونَ لَوْمَةَ لَائِمٍ ۚ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ وَاسِعٌ عَلِيمٌ"
      },
      {
        "reference": "Surah Ali 'Imran 3:31",
        "arabic_text": "قُلْ إِن كُنتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ",
        "translation": "Say, [O Muhammad], 'If you love Allah, then follow me, [so] Allah will love you and forgive you your sins.'",
        "reflection": "This verse connects love of Allah with obedience to the Prophet Muhammad, teaching that genuine love manifests in following divine guidance.",
        "verseNumber": 342,
        "surahNumber": 3,
        "ayahNumber": [
          31
        ],
        "full_verse": "قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ"
      },
      {
        "reference": "Surah Al-Hujurat 49:10",
        "arabic_text": "إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ",
        "translation": "The believers are but brothers, so make settlement between your brothers.",
        "reflection": "Brotherhood among believers is established as a fundamental bond of faith, emphasizing that love within the community is essential to Islamic practice.",
        "verseNumber": 4701,
        "surahNumber": 49,
        "ayahNumber": [
          10
        ],
        "full_verse": "إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ"
      },
      {
        "reference": "Surah Al-Balad 90:17",
        "arabic_text": "ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ",
        "translation": "Then being among those who believed and advised one another to patience and advised one another to compassion.",
        "reflection": "This verse pairs compassionate love with faith and patience, highlighting that believers should actively encourage one another toward loving kindness.",
        "verseNumber": 6026,
        "surahNumber": 90,
        "ayahNumber": [
          17
        ],
        "full_verse": "ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ"
      },
      {
        "reference": "Surah Al-Jumu'ah 62:11",
        "arabic_text": "وَاللَّهُ خَيْرُ الرَّازِقِينَ",
        "translation": "And Allah is the best of providers.",
        "reflection": "This verse reminds believers of Allah's perfect love expressed through His provision, encouraging trust in divine care rather than worldly attachments.",
        "verseNumber": 5369,
        "surahNumber": 62,
        "ayahNumber": [
          11
        ],
        "full_verse": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ"
      },
      {
        "reference": "Surah At-Tawbah 9:40",
        "arabic_text": "إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
        "translation": "When he said to his companion, 'Do not grieve; indeed Allah is with us.'",
        "reflection": "This verse from the story of the Prophet and Abu Bakr in the cave demonstrates how love between believers manifests in reassurance during difficult times, grounded in faith in Allah's presence.",
        "verseNumber": 1276,
        "surahNumber": 9,
        "ayahNumber": [
          40
        ],
        "full_verse": "إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ"
      }
    ],
    "fear": [
      {
        "reference": "Surah Al-Baqarah 2:155",
        "arabic_text": "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ",
        "translation": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient.",
        "reflection": "This verse acknowledges fear as an inevitable test, but offers reassurance that patience through fear leads to divine reward.",
        "verseNumber": 162,
        "surahNumber": 2,
        "ayahNumber": [
          155
        ],
        "full_verse": "وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ"
      },
      {
        "reference": "Surah Al-Baqarah 2:38",
        "arabic_text": "فَمَن تَبِعَ هُدَايَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
        "translation": "Whoever follows My guidance - there will be no fear concerning them, nor will they grieve.",
        "reflection": "Following divine guidance is presented as the antidote to fear, showing that spiritual alignment protects the heart from being overcome by fear.",
        "verseNumber": 45,
        "surahNumber": 2,
        "ayahNumber": [
          38
        ],
        "full_verse": "قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًا ۖ فَإِمَّا يَأْتِيَنَّكُمْ مِنِّي هُدًى فَمَنْ تَبِعَ هُدَايَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ"
      },
      {
        "reference": "Surah Al-Imran 3:175",
        "arabic_text": "إِنَّمَا ذَٰلِكُمُ الشَّيْطَانُ يُخَوِّفُ أَوْلِيَاءَهُ فَلَا تَخَافُوهُمْ وَخَافُونِ إِن كُنتُم مُّؤْمِنِينَ",
        "translation": "That is only Satan who frightens [you] of his supporters. So fear them not, but fear Me, if you are [indeed] believers.",
        "reflection": "This verse redirects our fear from worldly threats to a healthy fear of Allah, teaching that proper fear orientation is essential to faith.",
        "verseNumber": 486,
        "surahNumber": 3,
        "ayahNumber": [
          175
        ],
        "full_verse": "إِنَّمَا ذَٰلِكُمُ الشَّيْطَانُ يُخَوِّفُ أَوْلِيَاءَهُ فَلَا تَخَافُوهُمْ وَخَافُونِ إِنْ كُنْتُمْ مُؤْمِنِينَ"
      },
      {
        "reference": "Surah Al-Anfal 8:10",
        "arabic_text": "وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ",
        "translation": "And Allah made it not except as [a source of] good tidings and to reassure your hearts thereby.",
        "reflection": "Allah reminds believers that divine reassurance can calm even the most fearful hearts, emphasizing that true security comes only from trust in Allah.",
        "verseNumber": 1129,
        "surahNumber": 8,
        "ayahNumber": [
          10
        ],
        "full_verse": "وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ ۚ وَمَا النَّصْرُ إِلَّا مِنْ عِنْدِ اللَّهِ ۚ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ"
      },
      {
        "reference": "Surah Yunus 10:62-63",
        "arabic_text": "أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ ۝ الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ",
        "translation": "Unquestionably, for the allies of Allah there is no fear concerning them, nor do they grieve. Those who believed and were fearing Allah.",
        "reflection": "This verse promises freedom from fear to those who align themselves with Allah through faith and God-consciousness, showing fear's absence as a divine blessing.",
        "verseNumber": 1419,
        "surahNumber": 10,
        "ayahNumber": [
          62,
          63
        ],
        "full_verse": "أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ"
      },
      {
        "reference": "Surah Ta-Ha 20:46",
        "arabic_text": "قَالَ لَا تَخَافَا ۖ إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ",
        "translation": "Allah said, 'Fear not. Indeed, I am with you both; I hear and I see.'",
        "reflection": "This verse from Allah's words to Moses and Aaron offers the ultimate comfort for fear: divine presence, hearing, and seeing, reminding believers that awareness of Allah's companionship dispels fear.",
        "verseNumber": 2468,
        "surahNumber": 20,
        "ayahNumber": [
          46
        ],
        "full_verse": "قَالَ لَا تَخَافَا ۖ إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ"
      },
      {
        "reference": "Surah At-Tawbah 9:40",
        "arabic_text": "لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
        "translation": "Do not grieve; indeed Allah is with us.",
        "reflection": "These words of the Prophet to Abu Bakr in the cave exemplify how awareness of Allah's presence transforms fear into tranquility, teaching that divine companionship is the ultimate source of courage.",
        "verseNumber": 1276,
        "surahNumber": 9,
        "ayahNumber": [
          40
        ],
        "full_verse": "إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ"
      }
    ]
  }
]
